





//2


/////////////////////////////////////////////////////////////////////////////////////////////
// Найти квадратное уравнение
// 2x^2 + 9x + 4 = 0

let d; // discriminant
const a = 2;
const b = 9;
const c = 4;
d = b**2 - 4*a*c;
console.log(d); // d > 0, we have 2 roots;

let x1 , x2;
x1 = (-b + d**0.5) / (2*a);
x2 = (-b - d**0.5) / (2*a);
console.log(x1, x2);



/////////////////////////////////////////////////////////////////////////////////////////////
// Число жителей города 185600 тыс. человек. Ежегодно население в нем увеличивается на 2%
// Напишите последовательность команд для вычисления кол-ва жителей города через n лет

let people = 185600;
let growth = 0.02;
let years = 10;
let newPeople = people * ((1 + growth) ** years);
console.log(Math.round(newPeople));



/////////////////////////////////////////////////////////////////////////////////////////////
// Составьте программу которая вычесляет периметр и площадь треугольника со строронами a, b, c

let a = 2;
let b = 3;
let c = 4;

let sp = (a + b + c) / 2; // semi-perimeter
let s = (sp * (sp - a) * (sp - b) * (sp - c)) * 0.5; //Heron's Formula

console.log(s);




